<template>
  <div class="agreement1">
    <main>
      <fieldset>
        <legend>网站注册服务条款</legend>
        <mark>禁止从事以下活动:</mark>
        <div>
          （1） 上载、张贴、发送电子邮件或传送任何非法、有害、胁迫、骚扰、侵害、中伤、粗俗、猥亵、诽谤、淫秽、侵害他人因隐私、种族歧视或其他另人不快的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料（以下简称内容）。<br/>

          （2） 以任何方式危害未成年人。<br/>

          （3） 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关。<br/>

          （4） 伪造标题或以其他方式操控识别资料，使人误认为该内容为”仓宝在线”所传送。<br/>

          （5） 将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送。<br/>

          （6） 将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、发送电子邮件或以其他方式传送。<br/>

          （7） 将广告函件、促销资料、"垃圾邮件"等，加以上载、张贴、发送电子邮件或以其他方式传送。供前述目的使用的专用区域除外。<br/>

          （8） 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送。<br/>

          （9） 干扰或破坏本服务或与本服务相连的服务器和网络，或不遵守本服务网络使用之规定。<br/>

          （10） 故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。<br/>

          （11） 跟踪或以其他方式骚扰他人。<br/>

          （12）用户对经由本服务上载、张贴、发送电子邮件或传送的内容负全部责任。
        </div>
      </fieldset>
    </main>
  </div>

</template>
<script>
export default {
  name: "Agreement1"
};
</script>
<style>
.agreement1 {
  display: flex;
  justify-content: center;
}
.agreement1 fieldset {
  margin: auto 15px auto 15px;
  min-width: 340px;
  max-width: 750px;
  border-radius: 8px;
  box-shadow: 0 0 10px 1px #5e35b1, 0 0 1px #5e35b1, 0 0 1px #5e35b1,
    0 0 1px #5e35b1, 0 0 1px #5e35b1, 0 0 1px #5e35b1, 0 0 1px #5e35b1;
  background-color: #fff;
}
</style>
